# frozen_string_literal: true

# TODO: Linux & macOS compatibility

# :Taps ------------------------------------------------------------------------
if OS.mac?
  tap 'homebrew/bundle'
  tap 'homebrew/cask'
  tap 'homebrew/core'
  tap 'homebrew/services'
  tap 'homebrew/cask-versions'
  tap 'homebrew/cask-fonts'
  tap 'mongodb/brew'
  tap 'shopify/shopify'
  tap 'ethereum/ethereum'
  tap 'aws/tap'
  tap 'dart-lang/dart'
  tap 'heroku/brew'
  tap 'sidneys/homebrew'
  tap 'tgotwig/linux-dust'
  tap 'leoafarias/fvm'
  tap 'clojure/tools'
  tap 'sass/sass'
  tap 'supabase/tap'
  tap 'planetscale/tap'
  tap 'planetscale/tap'
  tap 'koekeishiya/formulae'
  tap 'tako8ki/tap'
  tap 'jesseduffield/lazygit'
  tap 'jesseduffield/lazydocker'
  tap 'coursier/formulas'
  tap 'charmbracelet/tap'
  tap 'cloudflare/cloudflare'
  tap 'borkdude/brew'
  tap 'arrow2nd/tap'
  tap 'teamookla/speedtest'
  tap 'd12frosted/emacs-plus'
  tap 'borkdude/brew'
  tap 'ngrok/ngrok'
  tap 'earthly/earthly'
  tap 'oven-sh/bun'
  tap 'grishka/grishka'
  tap 'modularml/packages'
  tap 'symfony-cli/tap'
end
# :Brew ------------------------------------------------------------------------
if OS.mac?
  brew 'bash'
  brew 'fish'
  brew 'gh'
  brew 'volta'
  brew 'deno'
  brew 'mysql'
  brew 'anyenv'
  brew 'llvm'
  brew 'ninja'
  brew 'phpbrew'
  brew 'rustup-init'
  brew 'pyenv'
  brew 'rbenv'
  brew 'jq'
  brew 'tmux'
  brew 'tree'
  brew 'symfony-cli'
  brew 'ethereum'
  brew 'solidity'
  brew 'clojure'
  brew 'leiningen'
  brew 'babashka'
  brew 'sbcl'
  brew 'stack'
  brew 'go'
  brew 'mongodb-community'
  brew 'sass'
  brew 'duck'
  brew 'awscli'
  brew 'aws/tap/lightsailctl'
  brew 'dart'
  brew 'sqlite'
  brew 'terraform'
  brew 'azure-cli'
  brew 'themekit'
  brew 'act'
  brew 'hugo'
  brew 'heroku'
  brew 'tree-sitter'
  brew 'emacs'
  # brew 'emacs-plus', args: ['with-spacemacs-icon', 'with-native-comp']
  brew 'neovim', args: ['HEAD']
  brew 'lua'
  brew 'luajit', args: ['HEAD']
  brew 'luarocks'
  brew 'pure'
  brew 'starship'
  brew 'fzf'
  brew 'eza'
  brew 'bat'
  brew 'spotify-tui'
  brew 'shpotify'
  brew 'sl'
  brew 'ffmpeg'
  brew 'telnet'
  brew 'nginx'
  brew 'mkcert'
  brew 'aria2'
  brew 'cabextract'
  brew 'wimlib'
  brew 'cdrtools'
  brew 'sidneys/homebrew/chntpw'
  brew 'kotlin'
  brew 'nim'
  brew 'pdfcrack'
  brew 'hydra'
  brew 'aircrack-ng'
  brew 'hashcat'
  brew 'youtube-dl'
  brew 'yt-dlp'
  brew 'mplayer'
  brew 'pdf2svg'
  brew 'supabase'
  brew 'pscale'
  brew 'cfonts'
  brew 'pandoc'
  brew 'fx'
  brew 'arduino-cli'
  brew 'zig'
  brew 'neofetch'
  brew 'caddy'
  brew 'scala'
  brew 'sbt'
  brew 'fd'
  brew 'ripgrep'
  brew 'pastel'
  brew 'broot'
  # brew 'unixodbc'
  brew 'tor', restart_service: true
  brew 'wget'
  brew 'mas'
  brew 'whalebrew'
  # brew 'fig'
  brew 'graphviz'
  # brew 'mono'
  brew 'gnucobol'
  brew 'git-delta'
  brew 'gitui'
  brew 'tokei'
  brew 'helix'
  brew 'kakoune'
  brew 'genact'
  brew 'onefetch'
  brew 'bottom'
  brew 'dust'
  brew 'goreleaser'
  brew 'redis'
  brew 'elixir'
  brew 'jmeter'
  brew 'imagemagick'
  brew 'maven'
  brew 'gradle'
  brew 'testdisk'
  brew 'duf'
  brew 'dog'
  brew 'zplug'
  brew 'lua-language-server'
  brew 'httpie'
  brew 'yabai'
  brew 'skhd'
  brew 'bandwhich'
  brew 'wego'
  brew 'gobang'
  brew 'watchman'
  brew 'cocoapods'
  brew 'streamlink'
  brew 'git-secrets'
  brew 'flyctl'
  brew 'erlang'
  brew 'ios-deploy'
  brew 'jless'
  brew 'elm'
  brew 'lazygit'
  brew 'lazydocker'
  brew 'ipfs' # ipfs/kubo
  brew 'coursier'
  brew 'thefuck'
  brew 'gum'
  brew 'vhs'
  brew 'ttyd', args: ['HEAD']
  brew 'cloudflared'
  brew 'ghcup'
  brew 'zola'
  brew 'direnv'
  brew 'fvm'
  brew 'gpg'
  brew 'clj-kondo'
  brew 'minikube'
  brew 'nekome'
  brew 'qemu'
  brew 'speedtest'
  brew 'golang-migrate'
  brew 'ngrok'
  brew 'shopify-cli'
  brew 'wp-cli'
  brew 'earthly'
  brew 'difftastic'
  brew 'putty'
  brew 'glow'
  brew 'git-filter-repo'
  brew 'jenkins'
  brew 'tnftp'
  brew 'openssl'
  brew 'ansible'
  brew 'pipx'
  brew 'lolcat'
  brew 'hyperfine'
  brew 'tldr'
  brew 'zoxide'
  brew 'procs'
  brew 'nushell'
  brew 'vapor'
  brew 'samba'
  brew 'mist'
  brew 'pkg-config'
  brew 'cairo'
  brew 'pango'
  brew 'libpng'
  brew 'jpeg'
  brew 'giflib'
  brew 'librsvg'
  brew 'pixman'
  brew 'smartmontools'
  brew 'mpv'
  brew 'wallpaper'
  brew 'ranger'
  brew 'w3m'
  brew 'pipes-sh'
  brew 'bun'
  brew 'neardrop'
  brew 'portaudio'
  brew 'monolith'
  # brew 'sapling'
  brew 'modular'
  brew 'pwgen'
  brew 'xsv'
  brew 'invoice'
end
# :Cask ------------------------------------------------------------------------
if OS.mac?
  cask 'google-chrome'
  cask 'brave-browser'
  cask 'vivaldi'
  cask 'firefox'
  cask 'firefox-developer-edition'
  cask 'blisk'
  cask 'google-drive'
  cask 'dropbox'
  cask '1password'
  cask 'iterm2'
  cask 'kitty'
  cask 'hyper'
  # cask 'sourcetree'
  cask 'github'
  cask 'mamp'
  cask 'visual-studio-code'
  cask 'docker'
  cask 'blackhole-2ch'
  cask 'blackhole-16ch'
  cask 'blackhole-64ch'
  cask 'skype'
  cask 'discord'
  cask 'zoom'
  cask 'obs'
  cask 'appcleaner'
  cask 'postman'
  cask 'spotify'
  cask 'vlc'
  cask 'steam'
  cask 'sublime-text'
  cask 'lapce'
  cask 'gitify'
  cask 'jetbrains-toolbox'
  cask 'tor-browser'
  cask 'keycastr'
  cask 'font-hack-nerd-font'
  cask 'font-monocraft'
  cask 'font-source-code-pro'
  cask '1password/tap/1password-cli'
  cask 'webtorrent'
  cask 'numi'
  cask 'powershell'
  cask 'ubersicht'
  # cask 'dotnet'
  cask 'dotnet-sdk'
  cask 'wireshark'
  cask 'drawio'
  # cask 'google-japanese-ime' # Failed to install
  cask 'alfred'
  # cask 'scenebuilder'
  # cask 'blender'
  cask 'cyberduck'
  # cask 'eqmac'
  # cask 'figma'
  # cask 'graphql-playground'
  cask 'handbrake'
  cask 'imageoptim'
  cask 'min'
  cask 'minecraft'
  # cask 'mongodb-compass'
  # cask 'mysqlworkbench'
  cask 'notion'
  cask 'poedit'
  # cask 'protonvpn'
  cask 'raspberry-pi-imager'
  cask 'sdformatter'
  cask 'unity-hub'
  cask 'ipfs' # ipfs/ipfs-desktop
  cask 'local'
  cask 'microsoft-teams'
  cask 'vagrant'
  cask 'brewlet'
  cask 'xquartz'
  cask 'sf-symbols'
  cask 'onyx'
  cask 'burp-suite'
  cask 'azure-data-studio'
  cask 'audacity'
  cask 'eclipse'
  cask 'orbstack'
  cask 'tableplus'
  cask 'hammerspoon'
  cask 'mjml'
  # cask 'asana'
  # cask 'wrike'
  # cask 'emacs'
  # cask 'native-access'
end
# :MAS - App Store --------------------------------------------------------------------
if OS.mac?
  mas 'Messenger', id: 1480068668
  mas 'LINE', id: 539883307
  mas 'KakaoTalk', id: 869223134
  mas 'Magnet', id: 441258766
  mas 'Twitter', id: 1482454543
  mas 'The Unarchiver', id: 425424353
  mas 'DaisyDisk', id: 411643860
  mas 'LanScan', id: 472226235
  mas 'Spark', id: 1176895641
  # mas 'Sequel Ace', id: 1518036000
  mas 'Slack', id: 803453959
  mas 'RunCat', id: 1429033973
  mas 'PopClip', id: 445189367
  mas 'Microsoft Word', id: 462054704
  mas 'Microsoft Excel', id: 462058435
  mas 'Microsoft PowerPoint', id: 462062816
  mas 'Microsoft Outlook', id: 985367838
  mas 'Tailscale', id: 1475387142
  mas 'Kindle', id: 302584613
  # mas 'Trello', id: 1278508951
  # mas 'DaVinci Resolve', id: 571213070
  # mas 'Final Cut Pro', id: 424389933
  # mas 'Motion', id: 434290957
  # mas 'Compressor', id: 424390742
  # mas 'Logic Pro', id: 634148309
  # mas 'MainStage', id: 634159523
end
