# frozen_string_literal: true

# :Cask ------------------------------------------------------------------------
if OS.mac?
  # cask '1password' installed
  # cask 'github' installed
  cask 'chromium', args: { 'no-quarantine': true }
  cask 'google-chrome'
  cask 'brave-browser'
  cask 'vivaldi'
  cask 'firefox'
  cask 'firefox@developer-edition'
  cask 'blisk'
  cask 'google-drive'
  cask 'dropbox'
  cask 'iterm2'
  cask 'kitty'
  cask 'hyper'
  # cask 'sourcetree'
  cask 'mamp'
  cask 'visual-studio-code'
  cask 'docker'
  cask 'blackhole-2ch'
  cask 'blackhole-16ch'
  cask 'blackhole-64ch'
  cask 'skype'
  cask 'discord'
  cask 'zoom'
  cask 'obs'
  cask 'appcleaner'
  cask 'postman'
  cask 'spotify'
  cask 'vlc'
  cask 'steam'
  cask 'sublime-text'
  cask 'lapce'
  cask 'gitify'
  cask 'jetbrains-toolbox'
  cask 'tor-browser'
  cask 'keycastr'
  cask 'font-hack-nerd-font'
  cask 'font-monocraft'
  cask 'font-source-code-pro'
  cask '1password/tap/1password-cli'
  cask 'webtorrent'
  cask 'numi'
  cask 'powershell'
  cask 'ubersicht'
  # cask 'dotnet'
  cask 'dotnet-sdk'
  cask 'wireshark'
  cask 'drawio'
  # cask 'google-japanese-ime' # Failed to install
  cask 'alfred'
  # cask 'scenebuilder'
  cask 'blender'
  cask 'cyberduck'
  cask 'eqmac'
  cask 'figma'
  cask 'handbrake'
  cask 'imageoptim'
  cask 'min'
  cask 'minecraft'
  # cask 'mongodb-compass'
  cask 'notion'
  cask 'poedit'
  cask 'raspberry-pi-imager'
  cask 'sdformatter'
  cask 'unity-hub'
  cask 'ipfs' # ipfs/ipfs-desktop
  cask 'local'
  cask 'microsoft-teams'
  cask 'vagrant'
  cask 'brewlet'
  cask 'xquartz'
  cask 'sf-symbols'
  cask 'onyx'
  cask 'burp-suite'
  cask 'azure-data-studio'
  cask 'audacity'
  # cask 'eclipse' similarly casks are available
  cask 'tableplus'
  cask 'hammerspoon'
  cask 'mjml'
  cask 'termius'
  cask 'alacritty'
  cask 'wezterm'
  cask 'ghostty'
  cask 'arc'
  cask 'xbar'
  cask 'neovide'
  cask 'bartender'
  cask 'transmit'
  cask 'cloudflare-warp'
  cask 'diffusionbee'
  cask 'elgato-camera-hub'
  cask 'elgato-control-center'
  cask 'elgato-stream-deck'
  cask 'logi-options-plus'
  cask 'logitech-g-hub'
  cask 'obsidian'
  cask 'streamlabs'
  cask 'surge-xt'
  cask 'balenaetcher'
  cask 'bitcoin-core'
  cask 'whisky'
  cask 'epic-games'
  cask 'drivedx'
  cask 'xsplit-vcam'
  cask 'zulu@17'
  cask 'session-manager-plugin'
  cask 'chatgpt'
  cask 'background-music'
  cask 'alt-tab'
  cask 'lm-studio'
  # cask 'native-access'
end
